<?php

		/*
	$num = (isset ($_COOKIE["num"])) ? $_COOKIE["num"] : 0; // кукі запам'ятовуються в браузері
	$num++;
	setcookie ("num", $num, time () + 4);
	echo "Користувач обновив сторінку $num раз ";
		*/
	// сесії записується кукі з ідентифікатором (видаляється через 15 хв і треба переавторизація)

	session_start ();
	$num = (isset ($_COOKIE["num"])) ? $_COOKIE["num"] : 0; // кукі запам'ятовуються в браузері
	$num++;
	$_SESSION ["num"] = $num;
	echo "Користувач обновив сторінку $num раз ";




?>